; domain
(define (domain zeno-travel)
(:requirements :typing :strips)
(:types transportable city flevel - object
        aircraft person - transportable)

(:predicates (at ?x - transportable ?c - city)
             (in ?a - aircraft ?p - person)
	     (fuel-level ?a - aircraft ?l - flevel)
	     (next ?l1 - flevel ?l2 - flevel))


(:action board
 :parameters (?a - person ?b - aircraft ?c - city)

 :precondition (and (at ?a ?c)
                 (at ?b ?c))
 :effect (and (not (at ?a ?c))
              (in ?a ?b)))

(:action debark
 :parameters (?a - person ?b - aircraft ?c - city)

 :precondition (and (in ?a ?b)
                 (at ?b ?c))
 :effect (and (not (in ?a ?b))
              (at ?a ?c)))

(:action fly
 :parameters (?a - aircraft ?b - city ?c - city ?d - flevel ?e - flevel)

 :precondition (and (at ?a ?b)
                 (fuel-level ?a ?d)
		 (next ?e ?d))
 :effect (and (not (at ?a ?b))
              (at ?a ?c)
              (not (fuel-level ?a ?d))
              (fuel-level ?a ?e)))

(:action zoom
 :parameters (?a - aircraft ?b - city ?c - city ?d - flevel ?e - flevel ?f - flevel)

 :precondition (and (at ?a ?b)
                 (fuel-level ?a ?d)
		 (next ?e ?d)
		 (next ?f ?e)
		)
 :effect (and (not (at ?a ?b))
              (at ?a ?c)
              (not (fuel-level ?a ?d))
              (fuel-level ?a ?f)
	)
)

(:action refuel
 :parameters (?a - aircraft ?b - city ?c - flevel ?d - flevel)

 :precondition (and (fuel-level ?a ?c)
                 (next ?c ?d)
                 (at ?a ?b))
 :effect (and (fuel-level ?a ?d) (not (fuel-level ?a ?c))))


)

; problem
(define (problem ZTRAVEL-7-25)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	plane2 - aircraft
	plane3 - aircraft
	plane4 - aircraft
	plane5 - aircraft
	plane6 - aircraft
	plane7 - aircraft
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	person9 - person
	person10 - person
	person11 - person
	person12 - person
	person13 - person
	person14 - person
	person15 - person
	person16 - person
	person17 - person
	person18 - person
	person19 - person
	person20 - person
	person21 - person
	person22 - person
	person23 - person
	person24 - person
	person25 - person
	city0 - city
	city1 - city
	city2 - city
	city3 - city
	city4 - city
	city5 - city
	city6 - city
	city7 - city
	city8 - city
	city9 - city
	city10 - city
	city11 - city
	city12 - city
	city13 - city
	city14 - city
	city15 - city
	city16 - city
	fl0 - flevel
	fl1 - flevel
	fl2 - flevel
	fl3 - flevel
	fl4 - flevel
	fl5 - flevel
	fl6 - flevel
	)
(:init
	(at plane1 city4)
	(fuel-level plane1 fl3)
	(at plane2 city1)
	(fuel-level plane2 fl5)
	(at plane3 city8)
	(fuel-level plane3 fl4)
	(at plane4 city5)
	(fuel-level plane4 fl0)
	(at plane5 city13)
	(fuel-level plane5 fl5)
	(at plane6 city2)
	(fuel-level plane6 fl2)
	(at plane7 city16)
	(fuel-level plane7 fl6)
	(at person1 city11)
	(at person2 city3)
	(at person3 city5)
	(at person4 city7)
	(at person5 city7)
	(at person6 city6)
	(at person7 city11)
	(at person8 city6)
	(at person9 city5)
	(at person10 city11)
	(at person11 city4)
	(at person12 city5)
	(at person13 city8)
	(at person14 city15)
	(at person15 city5)
	(at person16 city2)
	(at person17 city1)
	(at person18 city1)
	(at person19 city12)
	(at person20 city13)
	(at person21 city16)
	(at person22 city5)
	(at person23 city12)
	(at person24 city9)
	(at person25 city4)
	(next fl0 fl1)
	(next fl1 fl2)
	(next fl2 fl3)
	(next fl3 fl4)
	(next fl4 fl5)
	(next fl5 fl6)
)
(:goal (and
	(at plane1 city4)
	(at plane3 city3)
	(at person1 city2)
	(at person2 city1)
	(at person3 city7)
	(at person4 city14)
	(at person5 city8)
	(at person6 city11)
	(at person7 city12)
	(at person8 city1)
	(at person9 city6)
	(at person10 city0)
	(at person11 city11)
	(at person12 city14)
	(at person13 city3)
	(at person14 city10)
	(at person15 city1)
	(at person16 city8)
	(at person17 city2)
	(at person18 city8)
	(at person19 city14)
	(at person20 city9)
	(at person21 city14)
	(at person22 city2)
	(at person23 city10)
	(at person24 city9)
	(at person25 city14)
	))

)

; plan
1. (board person21 plane7 city16)
   deleted: (at person21 city16)
   added: (in person21 plane7)
   goals met: 2 of 27
2. (zoom plane7 city16 city14 fl6 fl5 fl4)
   deleted: (at plane7 city16) (fuel-level plane7 fl6)
   added: (at plane7 city14) (fuel-level plane7 fl4)
   goals met: 2 of 27
3. (debark person21 plane7 city14)
   deleted: (in person21 plane7)
   added: (at person21 city14)
   goals met: 3 of 27
4. (board person16 plane6 city2)
   deleted: (at person16 city2)
   added: (in person16 plane6)
   goals met: 3 of 27
5. (zoom plane6 city2 city8 fl2 fl1 fl0)
   deleted: (at plane6 city2) (fuel-level plane6 fl2)
   added: (at plane6 city8) (fuel-level plane6 fl0)
   goals met: 3 of 27
6. (debark person16 plane6 city8)
   deleted: (in person16 plane6)
   added: (at person16 city8)
   goals met: 4 of 27
7. (board person20 plane5 city13)
   deleted: (at person20 city13)
   added: (in person20 plane5)
   goals met: 4 of 27
8. (zoom plane5 city13 city9 fl5 fl4 fl3)
   deleted: (at plane5 city13) (fuel-level plane5 fl5)
   added: (at plane5 city9) (fuel-level plane5 fl3)
   goals met: 4 of 27
9. (debark person20 plane5 city9)
   deleted: (in person20 plane5)
   added: (at person20 city9)
   goals met: 5 of 27
10. (board person9 plane4 city5)
   deleted: (at person9 city5)
   added: (in person9 plane4)
   goals met: 5 of 27
11. (refuel plane4 city5 fl0 fl1)
   deleted: (fuel-level plane4 fl0)
   added: (fuel-level plane4 fl1)
   goals met: 5 of 27
12. (board person3 plane4 city5)
   deleted: (at person3 city5)
   added: (in person3 plane4)
   goals met: 5 of 27
13. (board person22 plane4 city5)
   deleted: (at person22 city5)
   added: (in person22 plane4)
   goals met: 5 of 27
14. (board person15 plane4 city5)
   deleted: (at person15 city5)
   added: (in person15 plane4)
   goals met: 5 of 27
15. (board person12 plane4 city5)
   deleted: (at person12 city5)
   added: (in person12 plane4)
   goals met: 5 of 27
16. (zoom plane3 city8 city11 fl4 fl3 fl2)
   deleted: (at plane3 city8) (fuel-level plane3 fl4)
   added: (at plane3 city11) (fuel-level plane3 fl2)
   goals met: 5 of 27
17. (board person13 plane6 city8)
   deleted: (at person13 city8)
   added: (in person13 plane6)
   goals met: 5 of 27
18. (refuel plane6 city8 fl0 fl1)
   deleted: (fuel-level plane6 fl0)
   added: (fuel-level plane6 fl1)
   goals met: 5 of 27
19. (fly plane6 city8 city3 fl1 fl0)
   deleted: (at plane6 city8) (fuel-level plane6 fl1)
   added: (at plane6 city3) (fuel-level plane6 fl0)
   goals met: 5 of 27
20. (board person2 plane6 city3)
   deleted: (at person2 city3)
   added: (in person2 plane6)
   goals met: 5 of 27
21. (refuel plane6 city3 fl0 fl1)
   deleted: (fuel-level plane6 fl0)
   added: (fuel-level plane6 fl1)
   goals met: 5 of 27
22. (debark person13 plane6 city3)
   deleted: (in person13 plane6)
   added: (at person13 city3)
   goals met: 6 of 27
23. (fly plane6 city3 city1 fl1 fl0)
   deleted: (at plane6 city3) (fuel-level plane6 fl1)
   added: (at plane6 city1) (fuel-level plane6 fl0)
   goals met: 6 of 27
24. (debark person2 plane6 city1)
   deleted: (in person2 plane6)
   added: (at person2 city1)
   goals met: 7 of 27
25. (board person7 plane3 city11)
   deleted: (at person7 city11)
   added: (in person7 plane3)
   goals met: 7 of 27
26. (board person10 plane3 city11)
   deleted: (at person10 city11)
   added: (in person10 plane3)
   goals met: 7 of 27
27. (board person1 plane3 city11)
   deleted: (at person1 city11)
   added: (in person1 plane3)
   goals met: 7 of 27
28. (board person18 plane2 city1)
   deleted: (at person18 city1)
   added: (in person18 plane2)
   goals met: 7 of 27
29. (board person17 plane2 city1)
   deleted: (at person17 city1)
   added: (in person17 plane2)
   goals met: 7 of 27
30. (zoom plane2 city1 city2 fl5 fl4 fl3)
   deleted: (at plane2 city1) (fuel-level plane2 fl5)
   added: (at plane2 city2) (fuel-level plane2 fl3)
   goals met: 7 of 27
31. (debark person17 plane2 city2)
   deleted: (in person17 plane2)
   added: (at person17 city2)
   goals met: 8 of 27
32. (zoom plane2 city2 city8 fl3 fl2 fl1)
   deleted: (at plane2 city2) (fuel-level plane2 fl3)
   added: (at plane2 city8) (fuel-level plane2 fl1)
   goals met: 8 of 27
33. (debark person18 plane2 city8)
   deleted: (in person18 plane2)
   added: (at person18 city8)
   goals met: 9 of 27
34. (board person25 plane1 city4)
   deleted: (at person25 city4)
   added: (in person25 plane1)
   goals met: 9 of 27
35. (board person11 plane1 city4)
   deleted: (at person11 city4)
   added: (in person11 plane1)
   goals met: 9 of 27
36. (zoom plane1 city4 city11 fl3 fl2 fl1)
   deleted: (at plane1 city4) (fuel-level plane1 fl3)
   added: (at plane1 city11) (fuel-level plane1 fl1)
   goals met: 8 of 27
37. (debark person11 plane1 city11)
   deleted: (in person11 plane1)
   added: (at person11 city11)
   goals met: 9 of 27
38. (fly plane1 city11 city14 fl1 fl0)
   deleted: (at plane1 city11) (fuel-level plane1 fl1)
   added: (at plane1 city14) (fuel-level plane1 fl0)
   goals met: 9 of 27
39. (refuel plane1 city14 fl0 fl1)
   deleted: (fuel-level plane1 fl0)
   added: (fuel-level plane1 fl1)
   goals met: 9 of 27
40. (debark person25 plane1 city14)
   deleted: (in person25 plane1)
   added: (at person25 city14)
   goals met: 10 of 27
41. (fly plane1 city14 city4 fl1 fl0)
   deleted: (at plane1 city14) (fuel-level plane1 fl1)
   added: (at plane1 city4) (fuel-level plane1 fl0)
   goals met: 11 of 27
42. (zoom plane3 city11 city0 fl2 fl1 fl0)
   deleted: (at plane3 city11) (fuel-level plane3 fl2)
   added: (at plane3 city0) (fuel-level plane3 fl0)
   goals met: 11 of 27
43. (refuel plane3 city0 fl0 fl1)
   deleted: (fuel-level plane3 fl0)
   added: (fuel-level plane3 fl1)
   goals met: 11 of 27
44. (debark person10 plane3 city0)
   deleted: (in person10 plane3)
   added: (at person10 city0)
   goals met: 12 of 27
45. (fly plane3 city0 city12 fl1 fl0)
   deleted: (at plane3 city0) (fuel-level plane3 fl1)
   added: (at plane3 city12) (fuel-level plane3 fl0)
   goals met: 12 of 27
46. (refuel plane3 city12 fl0 fl1)
   deleted: (fuel-level plane3 fl0)
   added: (fuel-level plane3 fl1)
   goals met: 12 of 27
47. (debark person7 plane3 city12)
   deleted: (in person7 plane3)
   added: (at person7 city12)
   goals met: 13 of 27
48. (board person23 plane3 city12)
   deleted: (at person23 city12)
   added: (in person23 plane3)
   goals met: 13 of 27
49. (board person19 plane3 city12)
   deleted: (at person19 city12)
   added: (in person19 plane3)
   goals met: 13 of 27
50. (fly plane3 city12 city10 fl1 fl0)
   deleted: (at plane3 city12) (fuel-level plane3 fl1)
   added: (at plane3 city10) (fuel-level plane3 fl0)
   goals met: 13 of 27
51. (refuel plane3 city10 fl0 fl1)
   deleted: (fuel-level plane3 fl0)
   added: (fuel-level plane3 fl1)
   goals met: 13 of 27
52. (debark person23 plane3 city10)
   deleted: (in person23 plane3)
   added: (at person23 city10)
   goals met: 14 of 27
53. (fly plane3 city10 city14 fl1 fl0)
   deleted: (at plane3 city10) (fuel-level plane3 fl1)
   added: (at plane3 city14) (fuel-level plane3 fl0)
   goals met: 14 of 27
54. (refuel plane3 city14 fl0 fl1)
   deleted: (fuel-level plane3 fl0)
   added: (fuel-level plane3 fl1)
   goals met: 14 of 27
55. (debark person19 plane3 city14)
   deleted: (in person19 plane3)
   added: (at person19 city14)
   goals met: 15 of 27
56. (fly plane3 city14 city2 fl1 fl0)
   deleted: (at plane3 city14) (fuel-level plane3 fl1)
   added: (at plane3 city2) (fuel-level plane3 fl0)
   goals met: 15 of 27
57. (refuel plane3 city2 fl0 fl1)
   deleted: (fuel-level plane3 fl0)
   added: (fuel-level plane3 fl1)
   goals met: 15 of 27
58. (debark person1 plane3 city2)
   deleted: (in person1 plane3)
   added: (at person1 city2)
   goals met: 16 of 27
59. (fly plane3 city2 city3 fl1 fl0)
   deleted: (at plane3 city2) (fuel-level plane3 fl1)
   added: (at plane3 city3) (fuel-level plane3 fl0)
   goals met: 17 of 27
60. (fly plane2 city8 city15 fl1 fl0)
   deleted: (at plane2 city8) (fuel-level plane2 fl1)
   added: (at plane2 city15) (fuel-level plane2 fl0)
   goals met: 17 of 27
61. (zoom plane5 city9 city6 fl3 fl2 fl1)
   deleted: (at plane5 city9) (fuel-level plane5 fl3)
   added: (at plane5 city6) (fuel-level plane5 fl1)
   goals met: 17 of 27
62. (board person8 plane5 city6)
   deleted: (at person8 city6)
   added: (in person8 plane5)
   goals met: 17 of 27
63. (board person6 plane5 city6)
   deleted: (at person6 city6)
   added: (in person6 plane5)
   goals met: 17 of 27
64. (board person14 plane2 city15)
   deleted: (at person14 city15)
   added: (in person14 plane2)
   goals met: 17 of 27
65. (refuel plane2 city15 fl0 fl1)
   deleted: (fuel-level plane2 fl0)
   added: (fuel-level plane2 fl1)
   goals met: 17 of 27
66. (fly plane2 city15 city10 fl1 fl0)
   deleted: (at plane2 city15) (fuel-level plane2 fl1)
   added: (at plane2 city10) (fuel-level plane2 fl0)
   goals met: 17 of 27
67. (debark person14 plane2 city10)
   deleted: (in person14 plane2)
   added: (at person14 city10)
   goals met: 18 of 27
68. (fly plane5 city6 city1 fl1 fl0)
   deleted: (at plane5 city6) (fuel-level plane5 fl1)
   added: (at plane5 city1) (fuel-level plane5 fl0)
   goals met: 18 of 27
69. (zoom plane7 city14 city7 fl4 fl3 fl2)
   deleted: (at plane7 city14) (fuel-level plane7 fl4)
   added: (at plane7 city7) (fuel-level plane7 fl2)
   goals met: 18 of 27
70. (board person5 plane7 city7)
   deleted: (at person5 city7)
   added: (in person5 plane7)
   goals met: 18 of 27
71. (board person4 plane7 city7)
   deleted: (at person4 city7)
   added: (in person4 plane7)
   goals met: 18 of 27
72. (refuel plane5 city1 fl0 fl1)
   deleted: (fuel-level plane5 fl0)
   added: (fuel-level plane5 fl1)
   goals met: 18 of 27
73. (debark person8 plane5 city1)
   deleted: (in person8 plane5)
   added: (at person8 city1)
   goals met: 19 of 27
74. (fly plane5 city1 city11 fl1 fl0)
   deleted: (at plane5 city1) (fuel-level plane5 fl1)
   added: (at plane5 city11) (fuel-level plane5 fl0)
   goals met: 19 of 27
75. (debark person6 plane5 city11)
   deleted: (in person6 plane5)
   added: (at person6 city11)
   goals met: 20 of 27
76. (zoom plane7 city7 city14 fl2 fl1 fl0)
   deleted: (at plane7 city7) (fuel-level plane7 fl2)
   added: (at plane7 city14) (fuel-level plane7 fl0)
   goals met: 20 of 27
77. (refuel plane7 city14 fl0 fl1)
   deleted: (fuel-level plane7 fl0)
   added: (fuel-level plane7 fl1)
   goals met: 20 of 27
78. (debark person4 plane7 city14)
   deleted: (in person4 plane7)
   added: (at person4 city14)
   goals met: 21 of 27
79. (fly plane7 city14 city8 fl1 fl0)
   deleted: (at plane7 city14) (fuel-level plane7 fl1)
   added: (at plane7 city8) (fuel-level plane7 fl0)
   goals met: 21 of 27
80. (debark person5 plane7 city8)
   deleted: (in person5 plane7)
   added: (at person5 city8)
   goals met: 22 of 27
81. (fly plane4 city5 city1 fl1 fl0)
   deleted: (at plane4 city5) (fuel-level plane4 fl1)
   added: (at plane4 city1) (fuel-level plane4 fl0)
   goals met: 22 of 27
82. (refuel plane4 city1 fl0 fl1)
   deleted: (fuel-level plane4 fl0)
   added: (fuel-level plane4 fl1)
   goals met: 22 of 27
83. (debark person15 plane4 city1)
   deleted: (in person15 plane4)
   added: (at person15 city1)
   goals met: 23 of 27
84. (fly plane4 city1 city14 fl1 fl0)
   deleted: (at plane4 city1) (fuel-level plane4 fl1)
   added: (at plane4 city14) (fuel-level plane4 fl0)
   goals met: 23 of 27
85. (refuel plane4 city14 fl0 fl1)
   deleted: (fuel-level plane4 fl0)
   added: (fuel-level plane4 fl1)
   goals met: 23 of 27
86. (debark person12 plane4 city14)
   deleted: (in person12 plane4)
   added: (at person12 city14)
   goals met: 24 of 27
87. (fly plane4 city14 city2 fl1 fl0)
   deleted: (at plane4 city14) (fuel-level plane4 fl1)
   added: (at plane4 city2) (fuel-level plane4 fl0)
   goals met: 24 of 27
88. (refuel plane4 city2 fl0 fl1)
   deleted: (fuel-level plane4 fl0)
   added: (fuel-level plane4 fl1)
   goals met: 24 of 27
89. (debark person22 plane4 city2)
   deleted: (in person22 plane4)
   added: (at person22 city2)
   goals met: 25 of 27
90. (fly plane4 city2 city6 fl1 fl0)
   deleted: (at plane4 city2) (fuel-level plane4 fl1)
   added: (at plane4 city6) (fuel-level plane4 fl0)
   goals met: 25 of 27
91. (refuel plane4 city6 fl0 fl1)
   deleted: (fuel-level plane4 fl0)
   added: (fuel-level plane4 fl1)
   goals met: 25 of 27
92. (debark person9 plane4 city6)
   deleted: (in person9 plane4)
   added: (at person9 city6)
   goals met: 26 of 27
93. (fly plane4 city6 city7 fl1 fl0)
   deleted: (at plane4 city6) (fuel-level plane4 fl1)
   added: (at plane4 city7) (fuel-level plane4 fl0)
   goals met: 26 of 27
94. (debark person3 plane4 city7)
   deleted: (in person3 plane4)
   added: (at person3 city7)
   goals met: 27 of 27
